# AZT509 - Azure Bastion                                                                                          

Azure Bastion can be abused to allow persistent network access to a virtual machine over public internet.

!!! info "Resource" 

	 Azure Bastion

!!! success "Actions"

	* Microsoft.Network/bastionHosts/write
	
	* Microsoft.Network/bastionHosts/createShareableLinks/action

	* Microsoft.Network/bastionHosts/getShareableLinks/action


!!! abstract "Detections"

	## **Logs** 

    | Data Source        | Operation Name      | Action                                                            | Log Provider |
    |--------------------|---------------------|-------------------------------------------------------------------|--------------|
    | Resource           | Get Bastion Shareable Link	 | Microsoft.Network/bastionHosts/GetShareableLinks/action	| AzureActivity |       
	| Resource           | N/A	 | Microsoft.Network/bastionHosts/write	| AzureActivity |   
	
	## **Queries**

	| Platform | Query |
    |----------|-------|
	| Log Analytics | `#!sql AzureActivity | where OperationNameValue =~ "MICROSOFT.NETWORK/BASTIONHOSTS/GETSHAREABLELINKS/ACTION" or OperationNameValue =~ "MICROSOFT.NETWORK/BASTIONHOSTS/CREATESHAREABLELINKS/ACTION` |	

!!! faq "Additional Resources"

	[https://blog.karims.cloud/2022/11/26/yet-another-azure-vm-persistence.html](https://blog.karims.cloud/2022/11/26/yet-another-azure-vm-persistence.html)