# AZT509 - Azure Bastion                                                                                          

Azure Bastion can be abused to allow persistent network access to a virtual machine over public internet.

!!! info "Resource" 

	 Azure Bastion

!!! success "Actions"

	* Microsoft.Network/bastionHosts/write
	
	* Microsoft.Network/bastionHosts/createShareableLinks/action

	* Microsoft.Network/bastionHosts/getShareableLinks/action


!!! abstract "Detections"

	## **Logs** 

    | Data Source        | Operation Name      | Action                                                            | Log Location |
    |--------------------|---------------------|-------------------------------------------------------------------|--------------|
    | Resource           | Get Bastion Shareable Link	 | Microsoft.Network/bastionHosts/GetShareableLinks/action	| Activity Log |       
	| Resource           | N/A	 | Microsoft.Network/bastionHosts/write	| Azure Activity Log |   
	
	## ** Queries**


	=== "Log Analytics"
	```AzureActivity 
        | where OperationNameValue =~ "MICROSOFT.NETWORK/BASTIONHOSTS/GETSHAREABLELINKS/ACTION" or OperationNameValue =~ "MICROSOFT.NETWORK/BASTIONHOSTS/CREATESHAREABLELINKS/ACTION"
        | order by TimeGenerated desc
        | project Caller, CallerIpAddress, OperationName, TimeGenerated, ResourceId
	```


!!! faq "Additional Resources"

	[https://blog.karims.cloud/2022/11/26/yet-another-azure-vm-persistence.html](https://blog.karims.cloud/2022/11/26/yet-another-azure-vm-persistence.html)